#!/bin/sh
# the next line restarts using wish \
exec wish "$0" "$@"
# -----------------------------------------------------------------------------
#  ボタンウィジェットをクリックして手続きBellを実行
# -----------------------------------------------------------------------------
# -----------------------------------------------------------------------------
# Bell
# ベルならして、コンソールに結果を表示する。
# 引数
#   なし
# -----------------------------------------------------------------------------
proc Bell {} {
    # ベルをならす
    bell
    # コンソール上に結果を表示する。
    puts "ベルを鳴しました。"
    return
}
# -----------------------------------------------------------------------------
#  メイン
# -----------------------------------------------------------------------------
# Windows版、Mac版ではコンソールを表示
switch $tcl_platform(platform) {
    windows -
    macintosh {
        console show
    }
}
# ボタンウィジェット.butの定義
button .but -text "押して♪" -command {Bell}
# packで配置
pack .but
# ---
# button_proc.tcl
